In [1]:
import pandas as pd
import database_utils as dbu

# 1. Test products table

In [2]:
query = '''
    select * 
    from products
    limit 5
'''

sample_products = dbu.query_sql(sql=query, database='supermarket.db')
sample_products

Query executed successfully!
query returned 5 rows

                   0           1       2
0            chicken        meat  5500.0
1               beef        meat  5000.0
2               pork        meat  4000.0
3            tilapia        meat  3500.0
4  laundry detergent  detergents  3000.0

In [3]:
import pandas as pd
import database_utils as dbu

# 2. Test transactions table

In [4]:
query = '''
    select * 
    from transactions
    limit 3
'''

sample_transactions = dbu.query_sql(sql=query, database='supermarket.db')
sample_transactions

Query executed successfully!
query returned 3 rows

                     0                  1     2           3
0  2021-03-01 09:00:00            oranges  29.0  location_1
1  2021-03-01 09:00:00  laundry detergent   6.0  location_1
2  2021-03-01 09:00:00            shampoo   4.0  location_1

# 3. Test Prices table

In [5]:
query = '''
    select * 
    from prices
    limit 10
'''

sample_prices = dbu.query_sql(sql=query, database='supermarket.db')
sample_prices

Query executed successfully!
query returned 10 rows

            0         1       2
0  location_1    coffee   289.0
1  location_1       tea   538.0
2  location_1      soda  1811.0
3  location_1    loaves  3574.0
4  location_1      buns  2867.0
5  location_1  cupcakes   888.0
6  location_1   cookies   966.0
7  location_1     beans  1136.0
8  location_1   ketchup  1940.0
9  location_1      beef  5800.0